src/DataProcessors/НормализацияСтроковыхПолейСправочников/НормализацияСтроковыхПолейСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>НормализацияСтроковыхПолейСправочников</name>
</mdclass:DataProcessor>

src/InformationRegisters/ДополнительныеНаименования/ДополнительныеНаименования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеНаименования</name>
  <comment>Наименования элементов структуры заказа и предметов снабжения на иностранном языке</comment>
  <resources>
    <name>Перевод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Владелец</name>
    <comment>Предмет снабжения либо элемент структуры заказа с типом &quot;Группа&quot;</comment>
    <type>
      <types>CatalogRef.ХарактеристикиПредметовСнабжения</types>
      <types>CatalogRef.ХарактеристикиКораблей</types>
      <types>CatalogRef.КатегорииЗаявокНаПоставкуПС</types>
      <types>CatalogRef.Флоты</types>
      <types>CatalogRef.ПроектыКораблей</types>
      <types>CatalogRef.СтруктураЗаказаПоКомплектующимИзделиямИЗИП</types>
      <types>CatalogRef.ЭтапыВыполненияЗаявокНаПоставкуПредметовСнабжения</types>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Язык</name>
    <type>
      <types>CatalogRef.Языки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/КаталогПредметовСнабжения/КаталогПредметовСнабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КаталогПредметовСнабжения</name>
  <attributes>
    <name>НомерОСК</name>
    <comment>Номер в каталоге ОСК</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обозначение</name>
    <comment>№ чертежа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбозначениеТранслитированное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УтвержденноеНаименование</name>
    <comment>Утвержденное наименование на русском</comment>
    <type>
      <types>CatalogRef.УтвержденныеНаименованияПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>СамостоятельнаяПоставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНаПоставку</name>
    <comment>ТУ, ГОСТ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>CatalogRef.ТипДокументацииДляИзготовленияИПоставкиПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <attributes>
    <name>NSN</name>
    <comment>Номер по системе кодификации НАТО</comment>
    <type>
      <types>String</types>
      <types>CatalogRef.ПредметыСнабженияНАТО</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕКПС</name>
    <type>
      <types>CatalogRef.ЕКПС</types>
    </type>
  </attributes>
  <attributes>
    <name>INCAT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурныйНомерВМФ</name>
    <comment>Номер по базе Юпитер-СТО</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКПД2</name>
    <type>
      <types>CatalogRef.ОКПД2</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.ТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПрошивки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрошивки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыЗаписейСправочниковИКаталогов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодСнятияСПроизводства</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаУпаковкиТранспортировкиХранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПоСтруктуре</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шифр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФНН</name>
    <comment>Федеральный номенклатурный номер</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШифрТранслитированный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИзготовителиИПоставщики</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Разработчик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изготовитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокиИзготовления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеПроизводства</name>
      <type>
        <types>CatalogRef.СостоянияПроизводстваПС</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗамены</name>
      <type>
        <types>CatalogRef.ТипыЗаменыПредметаСнабженияАналогом</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Характеристики</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Основная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтображениеДляЗаказчика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеИзКСУНСИ</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/СтруктураЗаказаПоКомплектующимИзделиямИЗИП/СтруктураЗаказаПоКомплектующимИзделиямИЗИП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураЗаказаПоКомплектующимИзделиямИЗИП</name>
  <comment>Электронная структура комплектующих изделий и ЗИП корабля</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Заказы</owners>
  <attributes>
    <name>Тип</name>
    <type>
      <types>CatalogRef.ТипыУзловЭлектроннойСтруктурыКомплектующихИзделийИЗИПКорабля</types>
    </type>
  </attributes>
  <attributes>
    <name>Заведование</name>
    <type>
      <types>CatalogRef.БоевыеЧасти</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <comment>Используется для элементов с типом &quot;Группа изделий&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредметСнабжения</name>
    <comment>Используется для элементов с типами &quot;Изделие&quot; и &quot;ЗИП&quot;</comment>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Используется для элементов с типами &quot;Изделие&quot; и &quot;ЗИП&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВЗИПБорт</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВЗИПБаза</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВЗИПДЭ</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВЗИПР</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПрошивки</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрошивки</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленИзСпецификации</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;. Значение Истина означает программное создание при обработке изменений спецификации предмета снабжения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСоставляющейЧасти</name>
    <type>
      <types>CatalogRef.РазделыСпецификацииЗИП</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПозицииСпецификации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗИП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбозначениеДоп</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПодчиненные</name>
    <comment>признак того, что элемент является родителем</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/НормализацияСтроковыхПолейСправочников/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Режим = "Одиночный";
	
	Для каждого ОбъектМетаданных Из Метаданные.Справочники Цикл
		
		СписокСправочников.Добавить(ОбъектМетаданных.Имя, ОбъектМетаданных.Синоним);
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьВЗависимостиОтРежима();
	
	Элементы.ГруппаВыполнение.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СинонимСправочникаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикВыбораСправочника", ЭтотОбъект);
	
	СписокСправочников.ПоказатьВыборЭлемента(ОписаниеОповещения, "Выбор справочника");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораСправочника(ВозЗнач, ДопПараметры = Неопределено) Экспорт

	Если Не ВозЗнач = Неопределено Тогда
	
		ИмяСправочника 		= ВозЗнач.Значение;
		СинонимСправочника 	= ВозЗнач.Представление;
		
		СформироватьСписокВыбораПолей();
	
	КонецЕсли;	

КонецПроцедуры // ОбработчикВыбораСправочника()

&НаСервере
Функция СформироватьСписокВыбораПолей()
	
	Элементы.СинонимПоля.СписокВыбора.Очистить();
	
	ТипСтрока = Тип("Строка");

	МетаданныеСправочника = Неопределено;
	Выполнить("МетаданныеСправочника = Справочники." + ИмяСправочника + ".ПустаяСсылка().Метаданные();");
	
	Для каждого СтандартныйРеквизит Из МетаданныеСправочника.СтандартныеРеквизиты Цикл
		
		Если СтандартныйРеквизит.Имя = "ИмяПредопределенныхДанных" Тогда
		
			Продолжить;	
		
		КонецЕсли;
	
		ОбработатьРеквизит(СтандартныйРеквизит, ТипСтрока);	
	
	КонецЦикла;
	
	Для каждого Реквизит Из МетаданныеСправочника.Реквизиты Цикл
	
		ОбработатьРеквизит(Реквизит, ТипСтрока);	
	
	КонецЦикла;

КонецФункции // СформироватьСписокВыбораПолей()

&НаСервере
Процедура ОбработатьРеквизит(Реквизит, ТипСтрока)

	Типы = Реквизит.Тип.Типы();
	
	Если Типы.Количество() = 1 Тогда
		
		Если Реквизит.Тип.Типы().Получить(0) = ТипСтрока Тогда
			
			Элементы.СинонимПоля.СписокВыбора.Добавить(Реквизит.Имя, Реквизит.Синоним); 		
			
		КонецЕсли; 	
		
	КонецЕсли;	
	
КонецПроцедуры // ОбработатьРеквизит()

&НаКлиенте
Процедура СинонимПоляОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИмяПоля = ВыбранноеЗначение;
	ЭлементСпискаВыбора = Элемент.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение);
	СинонимПоля = ?(ЗначениеЗаполнено(ЭлементСпискаВыбора.Представление), ЭлементСпискаВыбора.Представление, ЭлементСпискаВыбора.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьНормализацию(Команда)
	
	Если Не ЗначениеЗаполнено(ИмяСправочника) Тогда
	
		ПоказатьПредупреждение(, "Необходимо выбрать справочник",, "Действие запрещено");	
	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИмяПоля) Тогда
	
		ПоказатьПредупреждение(, "Необходимо выбрать поле",, "Действие запрещено");	
	
	КонецЕсли;
	
	Прогресс = 0;
	Пояснение = "";
	
	Элементы.ГруппаВыполнение.Видимость			= Истина;
	Элементы.НачатьНормализацию.Доступность		= Ложь;
	Элементы.РезультатыНормализации.Видимость	= Ложь;
	
	НачатьНормализациюВФоне();	
	
	ПодключитьОбработчикОжидания("ОбновитьПоказателиВыполнения", 5);
	
КонецПроцедуры

&НаСервере
Процедура НачатьНормализациюВФоне()
	
	АдресВременногоХранилища = ?(АдресВременногоХранилища = "", ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор), АдресВременногоХранилища);
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ИмяСправочника);
	МассивПараметров.Добавить(ИмяПоля);
	МассивПараметров.Добавить(АдресВременногоХранилища);

	ФоновоеЗадание = ФоновыеЗадания.Выполнить("ОбщиеФункцииСервер.НормализоватьЗначенияПоляСправочника", МассивПараметров, УникальныйИдентификатор, "Нормализация значений поля справочника");	

	ИдентификаторФоновогоЗадания = ФоновоеЗадание.УникальныйИдентификатор;
	
КонецПроцедуры // НачатьНормализациюВФоне()

&НаКлиенте
Процедура ОбновитьПоказателиВыполнения()
	
	СообщенияФоновогоЗадания = ПолучитьСообщенияФоновогоЗадания();
	
	Если СообщенияФоновогоЗадания = Неопределено Тогда
	
		ОтключитьОбработчикОжидания("ОбновитьПоказателиВыполнения");
		
		ПоказатьПредупреждение(, "Фоновое задание не обнаружено. Обратитесь к администратору.",, "Фоновое задание не обнаружено");
		
		Возврат;
	
	КонецЕсли;
	
	КоличествоСообщений = СообщенияФоновогоЗадания.Количество();
	
	Если КоличествоСообщений = 0 Тогда
		
		Возврат;			
		
	КонецЕсли;
	
	ПоследнееСообщение = СообщенияФоновогоЗадания.Получить(КоличествоСообщений - 1).Текст;
	
	ПозицияЗапятой = Найти(ПоследнееСообщение, ",");
	
	Прогресс = Число(Лев(ПоследнееСообщение, ПозицияЗапятой - 1)); 
	
	Пояснение = Прав(ПоследнееСообщение, СтрДлина(ПоследнееСообщение) - ПозицияЗапятой);
	
	Если Прогресс = 100 Тогда
		
		ОтключитьОбработчикОжидания("ОбновитьПоказателиВыполнения");
		Элементы.ГруппаВыполнение.Видимость 	= Ложь;
		Элементы.НачатьНормализацию.Доступность	= Истина;
		
		ВывестиРезультатыНормализации();	
		
	КонецЕсли;

КонецПроцедуры // ОбновитьПоказателиВыполнения()

&НаСервере
Функция ПолучитьСообщенияФоновогоЗадания()
	
	ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторФоновогоЗадания);
	
	Если ФоновоеЗадание = Неопределено Тогда
	
		Возврат Неопределено;	
	
	Иначе
	
		Возврат ФоновоеЗадание.ПолучитьСообщенияПользователю(Истина);	
	
	КонецЕсли;

КонецФункции // ПолучитьСообщенияФоновогоЗадания()

&НаСервере
Процедура ВывестиРезультатыНормализации()
	
	ТЗРезультатыНормализации = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	
	Если Не ТЗРезультатыНормализации = Неопределено Тогда
	
		РезультатыНормализации.Загрузить(ТЗРезультатыНормализации);	
		
		УдалитьИзВременногоХранилища(АдресВременногоХранилища);
		
		АдресВременногоХранилища = "";
		
		Элементы.РезультатыНормализации.Видимость = Истина;
	
	КонецЕсли;

КонецПроцедуры // ВывестиРезультатыНормализации()

&НаКлиенте
Процедура РежимПриИзменении(Элемент)
	
	УстановитьВидимостьВЗависимостиОтРежима();	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьВЗависимостиОтРежима()

	Если Режим = "Одиночный" Тогда
	
		Элементы.ГруппаРежимОдиночный.Видимость = Истина;
		Элементы.ГруппаРежимПодКлюч.Видимость	= Ложь;
	
	ИначеЕсли Режим = "ПодКлюч" Тогда
	
		Элементы.ГруппаРежимОдиночный.Видимость = Ложь;
		Элементы.ГруппаРежимПодКлюч.Видимость	= Истина;
		
		ЗаполнитьОбъектыНормализацииПодКлюч();
	
	КонецЕсли;	

КонецПроцедуры // УстановитьВидимостьВЗависимостиОтРежима()

&НаСервере
Процедура ЗаполнитьОбъектыНормализацииПодКлюч()

	Если ОбъектыНормализацииПодКлюч.Количество() > 0 Тогда
	
		Возврат;	
	
	КонецЕсли;	
	
	// Будут включены все строковые реквизиты справочников "КаталогПредметовСнабжения" и "СтруктураЗаказаПоКомплектующимИзделиямИЗИП", а также переводы
	
	// Найдем строковые поля справочников
	
	ТипСтрока = Тип("Строка");
	
	// Каталог предметов снабжения
	
	ОбработатьСправочникПодКлюч(Справочники.КаталогПредметовСнабжения.ПустаяСсылка().Метаданные(), "КаталогПредметовСнабжения", "Каталог предметов снабжения", ТипСтрока);
	
	// Комплектующие изделия и ЗИП
	
	ОбработатьСправочникПодКлюч(Справочники.СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПустаяСсылка().Метаданные(), "СтруктураЗаказаПоКомплектующимИзделиямИЗИП", "Комплектующие изделия и ЗИП", ТипСтрока);	
	
	// Определим, для каких реквизитов есть переводы
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОбъектыНормализацииПодКлюч.ИмяСправочника,
	|	ОбъектыНормализацииПодКлюч.СинонимСправочника,
	|	ОбъектыНормализацииПодКлюч.ИмяПоля,
	|	ОбъектыНормализацииПодКлюч.СинонимПоля
	|ПОМЕСТИТЬ ВТ_ОбъектыНормализацииПодКлюч
	|ИЗ
	|	&ОбъектыНормализацииПодКлюч КАК ОбъектыНормализацииПодКлюч
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""КаталогПредметовСнабжения"" КАК ИмяСправочника,
	|	ДополнительныеНаименования.ИмяРеквизита
	|ПОМЕСТИТЬ ВТ_ПоляСПереводом
	|ИЗ
	|	РегистрСведений.ДополнительныеНаименования КАК ДополнительныеНаименования
	|ГДЕ
	|	ДополнительныеНаименования.Владелец ССЫЛКА Справочник.КаталогПредметовСнабжения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""СтруктураЗаказаПоКомплектующимИзделиямИЗИП"",
	|	ДополнительныеНаименования.ИмяРеквизита
	|ИЗ
	|	РегистрСведений.ДополнительныеНаименования КАК ДополнительныеНаименования
	|ГДЕ
	|	ДополнительныеНаименования.Владелец ССЫЛКА Справочник.СтруктураЗаказаПоКомплектующимИзделиямИЗИП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОбъектыНормализацииПодКлюч.ИмяСправочника,
	|	ВТ_ОбъектыНормализацииПодКлюч.СинонимСправочника,
	|	ВТ_ОбъектыНормализацииПодКлюч.ИмяПоля,
	|	ВТ_ОбъектыНормализацииПодКлюч.СинонимПоля,
	|	НЕ ВТ_ПоляСПереводом.ИмяСправочника ЕСТЬ NULL  КАК Переводы
	|ИЗ
	|	ВТ_ОбъектыНормализацииПодКлюч КАК ВТ_ОбъектыНормализацииПодКлюч
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоляСПереводом КАК ВТ_ПоляСПереводом
	|		ПО ВТ_ОбъектыНормализацииПодКлюч.ИмяСправочника = ВТ_ПоляСПереводом.ИмяСправочника
	|			И ВТ_ОбъектыНормализацииПодКлюч.ИмяПоля = ВТ_ПоляСПереводом.ИмяРеквизита";
	
	Запрос.УстановитьПараметр("ОбъектыНормализацииПодКлюч", ОбъектыНормализацииПодКлюч.Выгрузить());
	
	ОбъектыНормализацииПодКлюч.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры // ЗаполнитьОбъектыНормализацииПодКлюч()

&НаСервере
Процедура ОбработатьСправочникПодКлюч(МетаданныеСправочника, ИмяСправочника, СинонимСправочника, ТипСтрока)

	Для каждого СтандартныйРеквизит Из МетаданныеСправочника.СтандартныеРеквизиты Цикл
		
		Если СтандартныйРеквизит.Имя = "ИмяПредопределенныхДанных" Тогда
		
			Продолжить;	
		
		КонецЕсли;
	
		ОбработатьРеквизитПодКлюч(СтандартныйРеквизит, ИмяСправочника, СинонимСправочника, ТипСтрока);	
	
	КонецЦикла;
	
	Для каждого Реквизит Из МетаданныеСправочника.Реквизиты Цикл
	
		ОбработатьРеквизитПодКлюч(Реквизит, ИмяСправочника, СинонимСправочника, ТипСтрока);	
	
	КонецЦикла;

КонецПроцедуры // ОбработатьСправочникПодКлюч()

&НаСервере
Процедура ОбработатьРеквизитПодКлюч(Реквизит, ИмяСправочника, СинонимСправочника, ТипСтрока)

	Типы = Реквизит.Тип.Типы();
	
	Если Типы.Количество() = 1 Тогда
		
		Если Реквизит.Тип.Типы().Получить(0) = ТипСтрока Тогда
			
			НоваяСтрока = ОбъектыНормализацииПодКлюч.Добавить();
			НоваяСтрока.ИмяСправочника 		= ИмяСправочника;
			НоваяСтрока.СинонимСправочника 	= СинонимСправочника;
			НоваяСтрока.ИмяПоля 			= Реквизит.Имя;
			НоваяСтрока.СинонимПоля 		= ?(ЗначениеЗаполнено(Реквизит.Синоним), Реквизит.Синоним, Реквизит.Имя); 		
			
		КонецЕсли; 	
		
	КонецЕсли;	

КонецПроцедуры // ОбработатьРеквизитПодКлюч()

&НаКлиенте
Процедура ВыполнитьНормализациюПодКлюч(Команда)
	
	Элементы.ГруппаВыполнение.Видимость					= Истина;
	Элементы.ВыполнитьНормализациюПодКлюч.Доступность	= Ложь;
	Элементы.РезультатыНормализацииПодКлюч.Видимость	= Ложь;	
	
	АдресВременногоХранилища = ?(АдресВременногоХранилища = "", ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор), АдресВременногоХранилища);
	
	Элементы.ОбъектыНормализацииПодКлюч.ТекущаяСтрока = 0;
	
	ПодключитьОбработчикОжидания("ВыполнениеНормализацииПодКлюч", 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнениеНормализацииПодКлюч()
	
	Если ИдетОбработкаТекущейСтроки Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	ИдетОбработкаТекущейСтроки = Истина;
	
	Строка = ОбъектыНормализацииПодКлюч.Получить(НомерТекущейСтроки);
	
	Прогресс = 0;
	Пояснение = "Идет обработка поля """ + Строка.СинонимПоля + """ справочника """ + Строка.СинонимСправочника + """.";
	
	НачатьНормализациюТекущейСтрокиВФоне(Строка.ИмяСправочника, Строка.ИмяПоля, Строка.Переводы);
	
	ПодключитьОбработчикОжидания("ОбновитьПоказателиВыполненияПодКлюч", 1);	

КонецПроцедуры // ВыполнениеНормализацииПодКлюч()

&НаСервере
Процедура НачатьНормализациюТекущейСтрокиВФоне(ИмяСправочника, ИмяПоля, ОбработатьПереводы)

	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ИмяСправочника);
	МассивПараметров.Добавить(ИмяПоля);
	МассивПараметров.Добавить(АдресВременногоХранилища);
	МассивПараметров.Добавить(ОбработатьПереводы);

	ФоновоеЗадание = ФоновыеЗадания.Выполнить("ОбщиеФункцииСервер.НормализоватьЗначенияПоляСправочника", МассивПараметров, УникальныйИдентификатор, "Нормализация значений поля справочника");	

	ИдентификаторФоновогоЗадания = ФоновоеЗадание.УникальныйИдентификатор;	

КонецПроцедуры // НачатьНормализациюТекущейСтрокиВФоне()

&НаКлиенте
Процедура ОбновитьПоказателиВыполненияПодКлюч()
	
	СообщенияФоновогоЗадания = ПолучитьСообщенияФоновогоЗадания();
	
	КоличествоСообщений = СообщенияФоновогоЗадания.Количество();
	
	Если КоличествоСообщений = 0 Тогда
		
		Возврат;			
		
	КонецЕсли;
	
	ПоследнееСообщение = СообщенияФоновогоЗадания.Получить(КоличествоСообщений - 1).Текст;
	
	ПозицияЗапятой = Найти(ПоследнееСообщение, ",");
	
	Прогресс = Число(Лев(ПоследнееСообщение, ПозицияЗапятой - 1)); 
	
	Строка = ОбъектыНормализацииПодКлюч.Получить(НомерТекущейСтроки);
	
	Пояснение = "Идет обработка поля """ + Строка.СинонимПоля + """ справочника """ + Строка.СинонимСправочника + """. " + Прав(ПоследнееСообщение, СтрДлина(ПоследнееСообщение) - ПозицияЗапятой);
	
	Если Прогресс = 100 Тогда
		
		ИдетОбработкаТекущейСтроки = Ложь;
		
		ОтключитьОбработчикОжидания("ОбновитьПоказателиВыполненияПодКлюч");
		
		Строка.Выполнено = Истина;
		
		НомерТекущейСтроки = НомерТекущейСтроки + 1;
		
		Если НомерТекущейСтроки = ОбъектыНормализацииПодКлюч.Количество() Тогда
			
			ОтключитьОбработчикОжидания("ВыполнениеНормализацииПодКлюч");
			
			Элементы.ГруппаВыполнение.Видимость 	= Ложь;
			Элементы.НачатьНормализацию.Доступность	= Истина;
			
		Иначе
			
			Элементы.ОбъектыНормализацииПодКлюч.ТекущаяСтрока = Элементы.ОбъектыНормализацииПодКлюч.ТекущаяСтрока + 1;	
			
		КонецЕсли;
		
		ВывестиРезультатыНормализацииПодКлюч(Строка.СинонимСправочника, Строка.СинонимПоля);
		
	КонецЕсли;

КонецПроцедуры // ОбновитьПоказателиВыполненияПодКлюч()

&НаСервере
Процедура ВывестиРезультатыНормализацииПодКлюч(СинонимСправочника, СинонимПоля)
	
	ТЗРезультатыНормализации = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	
	Если Не ТЗРезультатыНормализации = Неопределено Тогда
	
		Если ТЗРезультатыНормализации.Количество() > 0 Тогда
		
			Элементы.РезультатыНормализацииПодКлюч.Видимость = Истина;	
			
			Для каждого Строка Из ТЗРезультатыНормализации Цикл
			
				НоваяСтрока	= РезультатыНормализацииПодКлюч.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				НоваяСтрока.СинонимСправочника 	= СинонимСправочника;
				НоваяСтрока.СинонимПоля 		= СинонимПоля;
			
			КонецЦикла;
		
		КонецЕсли;	
		
		УдалитьИзВременногоХранилища(АдресВременногоХранилища);
	
	КонецЕсли;

КонецПроцедуры // ВывестиРезультатыНормализацииПодКлюч()
